---
layout:     article
title:      "c++反射"
subtitle:   " \"c++\""
date:       2022-03-21 14:00:00
author:     "Conerlius"
category: c++
keywords: c++
tags:
    - c++
---

[TOC]

很早前就想写一下关于c++的反射方面的内容了,今天要复习的时候，就顺便记录一下！

## RTTI

`RTTI(Runtime Type Information)`它提供了运行时确定对象类型的方法。

- typeid：返回指针或引用所指对象的实际类型。

- dynamic_cast：将基类类型的指针或引用安全的转换为派生类型的指针或引用。

### dynamic_cast

`dynamic_cast`会首先验证转换是否有效，只有转换有效，操作符才进行实际的转换。

### typeid
#### type_info
#### 带虚函数的基类
#### bad_typeid

## c++的反射简单机制

```c++
已启动生成…
1>------ 已启动生成: 项目: cppRTTI, 配置: Debug Win32 ------
1>Test3.cpp
1>class DynamicClassBase	size(1):
1>	+---
1>	+---
1>class DynamicClass	size(1):
1>	+---
1> 0	| +--- (base class DynamicClassBase)
1>	| +---
1>	+---
1>cppRTTI.vcxproj -> G:\other_workspace\cppRTTI\Debug\cppRTTI.exe
========== 生成: 成功 1 个，失败 0 个，最新 0 个，跳过 0 个 ==========
```